[
  {
    "name": "Klemens Strasser",
    "image_name": "klemens_strasser",
    "bio": "Klemens is a indie developer dedicated to crafting delightful apps with a strong focus on accessibility. He won an Apple Design Award as a Student in 2015 for his very first project, Elementary Minute. In 2025, his latest app, Art of Fauna, received both an Apple Design Award and an App Store Award. His work centers on creating thoughtful, high-quality experiences that are welcoming and usable for as many people as possible.",
    "bio_ja": "Klemensはアクセシビリティに強いこだわりを持ち、素晴らしいアプリを作ることに専念するインディー開発者です。2015年には学生として初めてのプロジェクト「Elementary Minute」でApple Design Awardを受賞しました。2025年には最新アプリ「Art of Fauna」がApple Design AwardとApp Store Awardの両方を受賞しました。彼の仕事は、できるだけ多くの人にとって親しみやすく使いやすい、思慮深く高品質な体験を創造することに重点を置いています。",
    "job_title": "Indie Developer",
    "links": [
      {
        "url": "https://x.com/klemensstrasser",
        "name": "@klemensstrasser"
      },
      {
        "url": "https://www.instagram.com/autrach",
        "name": "@autrach"
      },
      {
        "url": "https://bsky.app/profile/strasser.bsky.social",
        "name": "@strasser.bsky.social"
      }
    ]
  },
  {
    "name": "Yasuhiro Inami",
    "image_name": "yasuhiro_inami",
    "bio": "Inamiy is an iOS developer at Goodnotes, focusing on mobile app development and AI-powered features.\nHe is a big fan of functional programming including Swift, Haskell, and any statically typed languages that can check his bad code.\nNowadays, he has shifted toward compiler-like work that helps detect and correct poor code produced by AI.",
    "bio_ja": "GoodnotesでiOS開発者として働いており、モバイルアプリ開発とAI機能の開発に注力しています。\nSwift、Haskell、その他の静的型付け言語を含む関数型プログラミングの大ファンで、自分の悪いコードをチェックしてくれる言語が好きです。\n最近はAIが生成するコードの検出と修正を支援するコンパイラ的な作業にシフトしています。",
    "job_title": "Software Engineer at Goodnotes",
    "links": [
      {
        "url": "https://github.com/inamiy",
        "name": "@inamiy"
      }
    ]
  },
  {
    "name": "Joannis Orlandos",
    "image_name": "joannis_orlandos",
    "bio": "Joannis Orlandos is a cross-platform Swift developer and member of both the Swift Server Workgroup and Swift Android Workgroup. He announced the official Swift SDK for Android on Swift.org and co-founded Wendy Labs, creators of WendyOS—a Swift-first Linux distribution for embedded devices. Joannis maintains Hummingbird 2, created MongoKitten and Citadel, and co-runs SwiftOnServer.com",
    "bio_ja": "Joannis Orlandosはクロスプラットフォーム Swift 開発者であり、Swift Server WorkgroupとSwift Android Workgroupの両方のメンバーです。Swift.orgでAndroid向け公式Swift SDKを発表し、組み込みデバイス向けのSwiftファーストLinuxディストリビューション「WendyOS」を作成したWendy Labsを共同設立しました。JoannisはHummingbird 2のメンテナーであり、MongoKittenとCitadelを作成し、SwiftOnServer.comを共同運営しています。",
    "job_title": "OpenSource Maintainer / Co-Founder",
    "links": [
      {
        "url": "https://x.com/joannisorlandos",
        "name": "@joannisorlandos"
      },
      {
        "url": "https://github.com/joannis",
        "name": "@joannis"
      }
    ]
  },
  {
    "name": "Yuta Koshizawa",
    "image_name": "yuta_koshizawa",
    "bio": "Yuta is a software engineer specializing in iOS, Swift, and real-time image recognition. He is the author of 'Heart of Swift,' a widely read online Swift book in Japan. He also regularly hosts an online study group called 'Swift Zoomin''.",
    "bio_ja": "iOS、Swift、リアルタイム画像認識を専門とするソフトウェアエンジニアです。日本で広く読まれているオンラインSwift本「Heart of Swift」の著者です。また、「Swift Zoomin'」というオンライン勉強会を定期的に開催しています。",
    "job_title": "Chief Engineer at Qoncept",
    "links": [
      {
        "url": "https://x.com/koher",
        "name": "@koher"
      },
      {
        "url": "https://github.com/koher",
        "name": "@koher"
      }
    ]
  },
  {
    "name": "Natalia Panferova",
    "image_name": "natalia_panferova",
    "bio": "Natalia has been working in tech for over ten years, and most of her career has been dedicated to iOS development. She's worked in both small startups and large companies, and now she's focusing on her own projects at Nil Coalescing, a company she founded with her partner back in 2022. Right before that, she was part of the SwiftUI team at Apple, designing and building SwiftUI APIs.\n\nShe's very passionate about creating apps for Apple platforms and sharing her knowledge through her blog and books for Swift and SwiftUI developers. She lives in the South Island of New Zealand, and when she's not coding or writing, she loves going on nature walks with her partner and their two dogs.",
    "bio_ja": "Nataliaはテック業界で10年以上の経験があり、そのほとんどを iOS 開発に携わってきました。スタートアップから大企業までさまざまな環境で働いた経験があり、現在は 2022 年にパートナーとともに設立した会社「Nil Coalescing」で自身のプロジェクトに取り組んでいます。その前は Apple の SwiftUI チームに所属し、SwiftUI の API の設計と実装に携わっていました。\n\nApple プラットフォーム向けのアプリ開発に強い情熱を持っており、ブログや Swift / SwiftUI 開発者向けの書籍を通じて知識を共有することにも力を入れています。ニュージーランド南島在住で、コーディングや執筆をしていないときは、パートナーと 2 匹の犬と一緒に自然の中を散歩するのが好きです。",
    "job_title": "iOS Developer, Tech Blogger, Book Author",
    "links": [
      {
        "url": "https://github.com/nataliapanferova",
        "name": "@nataliapanferova"
      },
      {
        "url": "https://x.com/natpanferova",
        "name": "@natpanferova"
      },
      {
        "url": "https://bsky.app/profile/natpanferova.bsky.social",
        "name": "@natpanferova"
      }
    ]
  },
  {
    "name": "Daniel Steinberg",
    "image_name": "daniel_steinberg",
    "bio": "Daniel is the author of more than a dozen books including the best selling books The Curious Case of the Async Cafe, A SwiftUI Kickstart, A Swift Kickstart, A Bread Baking Kickstart, and Dear Elena.\n\nDaniel presents iOS, SwiftUI, and Swift training and consults through his company Dim Sum Thinking.\n\nHe has written apps for the iPhone and the iPad since the SDKs first appeared and has written programs for the Mac all the way back to System 7. When he's not coding or talking about coding for the Mac, the iPhone, and the iPad he's probably cooking, baking bread, or hanging out with friends.",
    "bio_ja": "Danielはこれまでに十数冊以上を執筆しており、その中にはベストセラーとなった『The Curious Case of the Async Cafe』『A SwiftUI Kickstart』『A Swift Kickstart』『A Bread Baking Kickstart』『Dear Elena』などがあります。\n\n自身の会社である Dim Sum Thinking を通じて、iOS・SwiftUI・Swift に関するトレーニングやコンサルティングを行っています。\n\niPhone と iPad の SDK が最初に公開された当初からこれらのデバイス向けのアプリを開発しており、Mac 向けのプログラムも System 7 の時代から書いてきました。Mac、iPhone、iPad 向けのコーディングやその話をしていないときは、たいてい料理をしたり、パンを焼いたり、友人たちと過ごしたりしています。",
    "job_title": "Storyteller",
    "links": [
      {
        "url": "https://linkedin.com/in/dimsumthinking",
        "name": "@dimsumthinking"
      }
    ]
  }
]
